{
  "album": "The Oddfather", 
  "lyrics": "\"Roll One\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Roll One\"\n(feat. Rich Homie Quan)\n\n\n\n[Hook: Gucci Mane]\nBaby, you so fly, I gotta let you know something\nAss pokin' out them jeans, you make me wanna poke something\n[?] one of them corner boys, them young niggas don't know nun\nTop grade marijuana, baby, I just wanna smoke something\nCan you roll one? Tell me, can you roll one?\nCan you roll one? Tell me, can you roll one?\nAss pokin' out them jeans, you make me wanna poke something\nI gotta let you know something, I'm gon' let you hold something\n\n[Verse 1: Gucci Mane]\nCopped two girls look just like you and we gon' have a foursome\nI got so much dro to roll, I think I wanna roll one\nI ain't none of these average joe, respect the fact, got cabbage, ho\nI ain't no horse and carriage, ho, I'm not with no marriage, ho\nGucci Mane go Macho Man on a bitch, Randy Savage\nIf you sicker than a [?] then Big Guwop got the antidote\nDiamonds on my pinky finger, same size as a cantaloupe\n[?] just like a antelope\nGucci Mane just cuttin' down trees, you don't know, bitch, call Geronimo\nThis money got me ten times more swagged out than I was a month ago\nAnd this paper got me too turnt up, just blasted off a blunt ago\nI turn Cassie to a nasty ho, Rihanna to a classy ho\n\n[Hook]\n\n[Verse 2: Rich Homie Quan]\nGet you out them panties, lay you on that sofa\nIt's just like a sandwich, come and eat this cold cut\nBaby girl feelin' herself, hands on her hips like \"So what?\"\nSwear to God she bent down for too long, it's time to go up\nLil money, bitch, it's time to grow up\nGet to grindin', grab the weed, get the blunts and roll up\nThem club owners know what's up, them girls wanna roll with us\nThey love how we showin' up, show up, big faces, throw up\nMe and Gucci brought cash to the club\nSmokin' out the bag in the club\nHold on, gotta gas in the club\nRich Homie bitch got the fattest ass in the club\nNiggas mad in the club\nBitch [?]\nWe gon' pull up last to the club\nMe and Meech still passin' on girls\nDrivin' with money, got cash in the car, shawty\n\n[Hook]\n\n[Verse 3: Gucci Mane]\nGucci ain't poppin', he think that he poppin'\nThat arrogant, ugly lil' son of a bitch\nSwear that he fresh and he think that he rich\nI'm gon' try hit every car that he get\nPardon my pimpin', man, pardon my pimpin'\nMan, pardon my pimpin', excuse my fish\nCome out the hip, shoot off the rip\nPick the grip up, man, I'm coming equipped\nPity the fool, pity the fool\nGet a [?] when I'm late on the rent\nStraight in [?], can't see past the tint\nLay in your britches, I'm pitching a tent\nYes, I admit, broke as a bitch\nNo window to throw out a pot and the piss\nBright as a bitch, pardon my French\nMy Rollie is yellow so pardon the piss\nI'm talking to Tony, I told you you monkey\nI warned you and warned you, now pay me me money\nI'll make you regret that you can't tell my country\nWhat would possess you to play with me money?\n[?] from monday to monday\nSunday to sunday, friday to thursday\nRun up on me, you thought you was splurging\nHit in the head and in need of a surgeon\n\n[Hook]\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_9842900/su_0/rs_0/tr_3vUCAEb-JUee1VhqjU0YD9HSUPGF6Otmwbpmdab01s80LPclnz-yFI86gBw6v_Z9Wzr601VaPx7I-wU-8HxNqsqVTr4jzUXajHRH6AdThHL9FVbYPPuAGdJoiJVPJ9ThvTvBcpstqHa0t4N7rRDVXtfhK0nag0rvLn0YwgyFRUpJ-akrL3cPwqGB-f7PTwZymiOIonzh1Ej3ZObZbwdaKVAxttDlXz0lp27yfHxPmpqQLOz4EHxTCXAkgCpE-SmAurTzxLMKdXxOCigK9ok4Q_4iip2gx3alHu1kWKSi35o_U-Pwoqzz8CjamJJ0tMZa3B0c-4JMTvoRwGyn6rSWWNBqFcxdjYvkgAc44wcuFdn2Foad94WwuFtWCAWSZRwsE-HROg8K3ncFTIgNohGEa2y20bxa5xRQRV-9q2gu6qg7UfPSVKLfN1uuRyYkesWaPA/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\nWriter(s): Davis Radric Delantic, Yancy Rodrequez Dejuan\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nmixtape: \"The Oddfather\" (2014)\nOddfather Intro (From The Inside)\nGunnin'\nBrick N a Brick\nFlight Risk\nTrap On Wheels\nP.A.M.\nTore Up\nBossed Up\nRGIII\nBirdies\nSay That Then\nRoll One\n\n\n\n\n\n\n Search", 
  "title": "Roll One Lyrics | AZLyrics.com", 
  "year": "2014"
}