{
  "album": "I'm Up", 
  "lyrics": "\"Gymnast\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Gymnast\"\n\n\n\n[Verse 1:]\nMade a promise to my self that I'll be never broke, counting up all this money but I'm never tired\nThree in the morning and I'm still going, jewelry so cold feel like the wind blowing. pushing more weight then\nArnold schwarzenegger walk-in closet feel with bells and glass (gucci) kill ya self my nigga do the world a favor, and I done lost count I got so\nMany haters, Canary watch I swear got yellow fever. Jimmy choo glasses so its hard to see ya, put my money on a tred mill\nAnd let it build [?]\n\n[Hook:]\nIma Gynast, Ima gymnast I'm in the kitchen flippen chickens Ima gymnast, I'm in the laboratory now doing chemistry, I can't lie me and\nMoney got a chemistry. (gucci) [X2]\n\n[Verse 2:]\nThrow the money in the air like I'm Elway, 50 bells at the house, Ima bellsmen.\nI got 65 thangs on the spressway, a couple boxes of mid is what they mail meh, I love my plug homie shout out to my esay, I got that [?]\nHomie you a swag stealer, I'm in My Big Dooley Truck,\nIt's a glass house, I'll turn ya sister condo into a trap house, on hand to hand with the cookies like a girl scout, winter time you might catch me in the stretch furr, all black Maybach with the chauffeur, Ima cooker but yo daddy is a smoker\n\n[Hook:]\n\n[Verse 3:]\nDirty money throw that money in the shower, she can't even feel her face cause of the powder, one spot three kitchens is a blow spot.\nCharge you twenty grand flat for some convo, keep the js mile high like the broncos,\nGot a nigga bussin bells in the living room, left ounce n half on the hard wood, count a half a million cash in the bedroom, never let a nigga know were yo stash at, Made 75k playing blackjack, let a nigga get it back playing cee-lo I'm on my old school shit playing kilo\n\n[Hook:]\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/http://tracking.musixmatch.com/t1.0/DFd9gOgOCmSkm2rJwzJTH0h7MhmH9tbW/24pKHf8q53RR2n8vE0b0h4eyM+2npkkedcgqcCJRqS4JqCZdim0I0UIPD9sjLz+jw0h2a2hSLXlCJt9G8wR2nHjqVb+yG3QvgWBZ3VYhX1bqUk1UAyQtlGHOlGLdPfhr2yuHrLLPqM=/?artist_name=GUCCI+MANE&track_name=Gymnast&s=f875edaeeb83216c730e020cf4005832\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nmixtape: \"I'm Up\" (2012)\nWithout Me\nI'm Up\nTrap Boomin'\nCyeah\nKansas\nWish You Would\nBrought Out Them Racks\nSpread The Word\nDrink Mud\nAnytime You Ready\nDon't Make No Sense\nSuper Cocky\nGymnast\nScarface\nCareless And Reckless\nGet Lost\nIt Ain't Funny\nPlain Jane\n\n\n\n\n\n\n Search", 
  "title": "Gymnast Lyrics | AZLyrics.com", 
  "year": "2012"
}