{
  "album": "Trap-A-Thon", 
  "lyrics": "\"Bad Guys\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Bad Guys\"\n(feat. Black Magic)\n\n\n\n[Intro]\nIt's the bad guys\nSay hello to the bad guys!\nBig Cat Records, Gucci, Black Magic\n\n[Chorus: repeat 2X]\nWe the bad guys, and we play for the bad team\nWe hauntin ya life like you just had a bad dream\nThe bad guys...\nJust don't get on our bad side\n\n[Gucci Mane]\nI fucks with the AR, I fucks with the AK\nYou fuckin with Gucci, you gon' have a bad day\nThey say I'm a mad guy, they call me the bad guy\nI tell ya like this just don't get on my bad side\nI come with that skreet shit, in love with this beef shit\nMy diamonds ocean blue so they might get ya seasick\nI fuck with the Glock 40, {?} shotty\nPlus when I aim then I aim for the upper body\nAin't with that hoe shit, I'm smokin that 'dro shit\nYou come with some mo' shit, you gon' get your throat slit\nYeah this is that G shit, we call it a classic\nI have my nigga Magic put that ass in a casket\nAnd that there is real talk, you best have a fast walk\nOr else yo' bitch ass might get lined in the white chalk\nFuck what you thank nigga, fuck what you thought nigga\nWired for jaw, so yo' ass can't talk nigga\n\n[Chorus]\n\n[Gucci Mane]\nIs you a man nigga? Is you a mouse nigga?\nHave yo' bitch ass scared to come out the house nigga\nGucci fear no man, so who is this Snowman?\nThe word on the low is he really a hoe man\nBitch stick to that trap shit, and stick to that rap shit\nYou say you a gangster, but you never clapped shit\nIf you wanna find me, take I-20 Flat Shoals\nLet's see if you can take this broomstick up your asshole\nAlways gon' stand ground, never gon' back down\nI'm puttin my mack down, I'm layin the smack down\nSee Gucci's a skreet nigga, I stay on that skreet shit\nAnd I'm the wrong nigga that ya clique wanna beef with\nI keep the 9 close like the bitch that you sleep with\nAnd I'll bust a head but can you keep a secret?\nI'm smokin that kushie, you niggaz is pussy\nI never been a killer but you pussies done pushed me\n\n[Chorus]\n\n[Black Magic]\nNow this the bad guy song, they put the bad guys on it\nSo listen when you hear the two bad guys talkin\nI shoot straight, move weight, always in a new state\nAlways givin fake names, cars got paper plates\nThe bad guy, say hello to my little friend (say hello)\nMy lil' friend got a hundred other lil' friends\nNow we the bad team, it's more than a bad dream\nGucci and Black Magic now that's a bad scene\nCarbon 15's comin out, AK's comin out\nI'ma run the North, Gucci run the South\nIndependent but we ballin like majors\nThem fruity ones got 'em all flavors\nI'm fuckin with real niggaz and players, killers and cutthroats\nAnd when I get a order homey somebody gettin smoked\nI'm no joke, catch the kid cookin up coke\nI got a blunt full of bubba kush, nigga come smoke with us\n\n[Chorus]\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_1475363/su_0/rs_0/tr_3vUCALytDHpacqJ1tuGOQNe4EvX76NNpC2sbBQCHcxiMv2wXw1RhtPzj17bHkADXNwXIRZy08-GqwoirUT_R47W53nrxKQJFyEupT99rEIzimBeL6U9rxgkoNsKrI--qBXyEzBbOFwX3VeRyWLOm8BsDTEB5WI9HKisT6lljUWEwnj8ulSf3AM15b2jD57_IdiwYnS8yhQMp0MNrX2XmtWdJvtiLY0Pf7_SVtgPSCsL_IQtg4BvWBgCvJCSs_r3Mwf4BJoWNGoPTOGDbAXDJd4FFF-5nA0076tcpR7JDhm-GLRjzBsrDkrhCjRNDq4_6ibwcsvTg-sg5_bgUprbA97kTRsSyynuOdISAn-UsT-ncmgg1vIQ9MrsiBAE76Z68a0HEUKarjNQpepjqLOI3CzYZv81tnDN7vDKi1qg-8CT36gDkMjUa26DyE3LKZKNTt72hY02LHvEdLwklvcCv7Q/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nalbum: \"Trap-A-Thon\" (2007)\nBig Cat (Intro)\nBling Bling\nRe-Up\nBig Cat's Home\nFreaky Gurl\nWhat They Do\nAw-Man\nGood News & Bad News\nChoppa Shoppin'\nBad Guys\nPillz (Remix)\nSpanish Plug\nProduct\nBosses Speak\nFreaky Gurl (Remix)\n2 Screws Loose\n\n\n\n\n\n\n Search", 
  "title": "Bad Guys Lyrics | AZLyrics.com", 
  "year": "2007"
}