{
  "album": "Trap-A-Thon", 
  "lyrics": "\"Bling Bling\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Bling Bling\"\n(feat. Big Tank)\n\n\n\n[Intro]\r\nGucci Mane in the buildng (Gucci Gucci)\r\nLaflare entertainment (Laflare)\r\nZaytoven on the track (Zay Tiggy)\r\nThat nigga Dest in the buildin (that boy Dest)\r\nBad Boy in this motherfucker (Bad Boy)\r\nBig Cat in this motherfucker (Big Cat)\r\nIs Laflare in this motherfucker? (That boy Gucci)\r\nYuh\n\n[Chorus: repeat 2X]\r\nI got your budget on my neck, your deal on my wrist\r\nYour whole entire life savings on my pinky nigga\r\nBling bling bling bling (bling bling bling bling)\r\nBling bling bling bling (bling bling bling bling)\n\n[Gucci Mane]\r\nSee I'm smokin on some bubba kush, come from California\r\nFunky like yo' daddy feet is stankin like ammonia\r\nNow I got his plug with this {?} in Arizona\r\nWhen I touch Atlanta they gon' tell my telephoner\r\nTrap niggaz, rap niggaz, wish they could clone us\r\nIcy cause I dig blue blue big bails of marijuana\r\nTrappin has advanced from just standin on the cornah\r\nViolators haters will be turned to organ donors\r\nChillin in the V.I., sippin on Corona\r\nI'ma get some head with this this bitch like this Patrona\r\nStop playing games girl cause I don't condone 'em\r\nIf you want some work don't come before like it's a zoner\r\nFifteen inches but my rims they some grown-ups\r\nSucker for a minute now a nigga has done blow up\r\nCheck my BDM's, look at my spins, daily goin up\r\nCheck, check my spins, daily goin up\n\n[Chorus]\n\n[Verse 2]\r\nCheck I'm out the Folia, foolin with that Scorpion\r\nIt's mess when that bad chick stride off the rodeo\r\nSmokin on the fire, got desire, do the holy crescent\r\nIf you ain't poppin no bottles right now (bruh ain't reppin)\r\nI'm the freshest from dirty, Westside rollin close to {?}\r\nFrom the alley, habits, might die from a overdose\r\nOn a mission my vision, clouded by the paper\r\nCrooked, took it, cut it, shave it with the razor\r\nEven miss my bread and butter, I ain't gettin offended\r\nRun it not in my budget, I ain't got to share it\r\nWho's your man? Like it, love it, not to want to play it\r\n{?} on them thugs, money on the table\r\nWho who play in the club? You fuckin with the mayor\r\nI'll be damned, fresh in the mud, put you on the payroll\r\nWhat'chu want? Say what you want, it's all about me\r\nWe get high and run in the hood, you fall around me\n\n[Chorus]\n\n[before third verse]\r\nBig Tank, Big Cat\r\nLet's get it in nigga\r\nUhh\n\n[Big Tank]\r\nI show you how to do this here, keep a light bluish ear\r\nSixty on them frightening, so you don't excite me\r\nHaters don't like me, and I don't like you either\r\nYou mad cause I'm stacked up, and you underachiever\r\nYou see the plat' Amex, you still fuck with Visas\r\nVietnam, Cakalak, niggaz throw the V's up\r\nNigga roll the trees up, what the fuck you waitin on?\r\nWe talkin 'bout this money, so go on make a hatin song\r\nGucci's on my feet, but my jeans look like dollar signs\r\n'cicles on my teeth, so I'm talkin money all the time\r\nG's I'ma follow mine, you don't want no part of mine\r\nChopper in the back'll have you leapin like Impala signs\r\nBig Tank, Big Cat, nigga what you know about it?\r\nSittin in the booth, and they told me bring the flow up out it\r\nGo getter fo' sho' about it, money over e'rythang\r\nStackin up this paper 'til it's higher than a airplane\n\n[Chorus]\n\n[Outro]\r\nUhh\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_7026068/su_0/rs_0/tr_3vUCAGFxr2VgzykCEMKGhtWfnk6n56mqqdLuU6jUQd08fONmr0wyJa6qgllYoXsaCltyciFTzWyRgPo5ZJrSYwTHWR2m8N-f_RNivGjq2hFep-Te1FIbZLeT67wmPeIp5p8801c3jk_EXmbxxkS4nBSDMeURNcrVE5vQA1z5X0nOZQ0Q07Wb0C6K1mXcBHKW9cpbdG-CNHsWvbc1jiN1XQ4tLD9rT_QUGUSKpNsq31sJqZKMDoG42XGkbPiwsGgePlwQ47gdwzV8ScR2WYU61oAS2MA7IUxZNYrWud62ogP1P0ihE484O_LYTkOOsLBsADBdS8fiGQgbH8uX8DqvrP7aAKlwf1nkk7uyR1IyXCYxRM0fdVSN6vwfBPUVAfaqH23P6RSFxkMjh_PLpLBC-6P3kIqk5lo1my50waJScbBK49sfSDiOO9vIL5Prj92NQQ/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\nWriter(s): Radric Delantic Davis, Xavier L. Dotson, Xavier Dotson\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nalbum: \"Trap-A-Thon\" (2007)\nBig Cat (Intro)\nBling Bling\nRe-Up\nBig Cat's Home\nFreaky Gurl\nWhat They Do\nAw-Man\nGood News & Bad News\nChoppa Shoppin'\nBad Guys\nPillz (Remix)\nSpanish Plug\nProduct\nBosses Speak\nFreaky Gurl (Remix)\n2 Screws Loose\n\n\n\n\n\n\n Search", 
  "title": "Bling Bling Lyrics | AZLyrics.com", 
  "year": "2007"
}