{
  "album": "Trap-A-Thon", 
  "lyrics": "\"Pillz (Remix)\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Pillz (Remix)\"\n(feat. Big Tank, Mac Bre-Z)\n\n\n\n[Intro]\n(Zaytoven!!)\nGeah! Gucci Mane, is in the buildin\nSo Icy Entertainment, Zaytoven on the track\nWhen we come to the club\nWe got the choppers on deck, and the yoppers on deck\n\n[Chorus]\n[MB] Is you rollin? [4X]\n[GM] Bitch I might be [4X]\n[MB] Girl he geeked up [4X]\n[GM] Bitch I might be [4X]\n[GM] Yaaaaahhh!\n\n[Verse 1]\nGame choppin like my rims, I'm choppin it up\n'Til my 'caine gold like a pimp, I'm fresh as a bud\nPlus I'm blowin on the sticky green, so I'm dro'ed up\nAnd I'm rollin on the bean, so the city SLOWED UP~!\nMy team showed up, so you know we need a party pack\nCallin Momma Stash, say she wanna be a part of that\nTell her I'm for real, and I keep a knot folded back\nThe next thang you know she tossin pills like a quarterback\nGuc', I'ma throw it back, stacks I just showed you that\nDeuces on the 88, they say I brought the roller back\nFifty for a dollar, hell yeah I can roll with that\nTake it to the hood and let, Yatta get ahold of that\nGot to be the coldest cat, ice froze the thermostats\nShawty had a Cali tat and Gucci called the Alley Cat\nShot a couple triple stacks and po'd up the iced tea\nSlide on my stunna shades; geeked up? I might be\n\n[Chorus]\n\n[Verse 2]\nSaid I'm higher than a kite and me geeked up on these pills\nSuave Stacks got me actin out, I know that she can tell\nthat I'm rollin (yeah) like the wheels on a bus\nI need a cold Tropicana cause my heart about to bust\nLook I'm sweatin like a dog and she askin for some mo'\nGave her couple of blue dolphins and I tell her to go raw\nBright lights lookin psychadelic, I'm off in the zone\nFeelin strong like Superman, bitch I bust your dome\nSaid I'm smokin all the purple and drinkin all the 'gnac up\nAnd I ain't feelin none of that until the next mornin bruh\nMy stomach fucked up, a couple holes in my brain\nBut I party like a rockstar, these bitches askin mane!\n\n[Chorus]\n\n[Gucci Mane]\nGucci Mane, Laflare nigga, get'cha mind right\nOrder Crist' by the 12 like a case of Bud Light\nSell kush by the bell so you know my shit tight\n7:30 in the mornin on an all night flight\nI'm high like Fabo, hood like Shawty\nSo (Tell Me Where to Go) like my name E-40\nA rich rock star nigga I'm gon' party\nGot a party pack of pills that's at least 'bout 40\nI'll pour 'em in yo' hand like a bag of jelly beans\nTake two of these pills call me in the morning\nFifty thousand pills man I'm so real\nThree dollars for a pill that's a damn good deal\n\n[Chorus]\n\n[Mac Bre-Z]\nAy whassup Gucci Mane!\nWhy you sweatin so hard?\nIs you rollin or somethin?\n\n[Gucci Mane]\nShit well baby I might be\nBut got damn what is you doin?\nYou jockin a playa, you chew-chewy over here right\nLook I aint K-Rab baby knahmean I'm not a piece of bubblegum\nWhat I'm doin is not your business\nBut matter of fact while you over here is you a waitress or somethin?\nCause the shit you got on make you look like you a waitress\nSo do what you do aight I'ma give you this hundred dollars\nGo get you whatever you drankin\nBring me and my clique about ten of them orange juices\nfive Crunk juices and we'll be straight how 'bout that\nAnd is you straight is you single or is you married?\nCause I might be, bitch I might be\nBitch I might be, bitch I might be\nYAAAAAAAHH\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_6893440/su_0/rs_0/tr_3vUCAJXqDMNGQ8QVa-c9qamAjRqGCz7NCtMOtsU9559H10Q4fDcUYrDGWR79b3AvZOzw09RRAMHCFB-_FI4ZpwHGgDkM6Mc8QeIfOiMOqlxC5PbWp9v9hr5jBnFxBgD5KgB9IQxEGe0F0EnrtY3k0V2lE-U-z7Lt-zec7SXcF_baS85PDrD5JEOblE_6US_-4PR0OrMM-y28TJY6VOH-FY5BtlmEwwtRWgMwR7EP_eOgCtjVgbgm4MySpFYix9AtPvPiTfHqLHA6oFb5rUxqZ7vGymTAqghFGQD65QYn5c-B2vJ8_ZDXAOYCG-Jwie9oSEJ95hOTm2NcCGDV7oygMjL_hU5Ayqd47nkXoc9mespGeBQH_BCgTZhZn1a8SEggrodSlSsO5ruhrJkT8vDVceTx95N99oXpeRtIa6ntbU2w4caKooma1CkqmD2YW1yITDOsnakWq8mnZAPWDlza/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\nWriter(s): Xavier Dotson, Radric Davis\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nalbum: \"Trap-A-Thon\" (2007)\nBig Cat (Intro)\nBling Bling\nRe-Up\nBig Cat's Home\nFreaky Gurl\nWhat They Do\nAw-Man\nGood News & Bad News\nChoppa Shoppin'\nBad Guys\nPillz (Remix)\nSpanish Plug\nProduct\nBosses Speak\nFreaky Gurl (Remix)\n2 Screws Loose\n\n\n\n\n\n\n Search", 
  "title": "Pillz (Remix) Lyrics | AZLyrics.com", 
  "year": "2007"
}