{
  "album": "Trap-A-Thon", 
  "lyrics": "\"Spanish Plug\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Spanish Plug\"\n\n\n\r\nWhen I see my plug this how I talk to em\r\nAnd when I serve my folks this how I talk to em\r\nWhen I'm with my dawgs this how I talk to em\r\nIt's gucci mane la flar I'm finna talk to em\n\r\nMy guala, my partna, mota manana? gracias denada brought me years of dollars\r\nQue pasa amigo? coca mudo necho cohina mucho es grande on the repo\r\nEse el pablo my barrio your barrio I'm ese my friende you speak real good engles\r\n600 wednesday 5000 tuesday el nombre es gucci no punta no pussy\r\nRonas and kushi kilos and elbows chito seritas they come from mexico\r\nThere he go, 20 tacos got me 50 burritos, s 550 mercedes on flat shoals, que pasa manana\r\nMy guala guala, my partna partna, love to treat a nigga to a stingin lobsta, now a nigga owe him a million dollars,\r\nGot me making 10 g's an hour, moneys power, time is money, you don't know the nigga then serve the dummy,\r\nServe the junkies then ride ashantis\n\n[Hook]\n\r\nWhat's the bombaglats my trap-spot, dreadlocks and rastas, rude boys and rude girls,\r\nJamaican mobsters, I shot the sheriff, smoking bob marley, all of this ecstacy is killing me softly\r\nTurgo and curry, mid grade so pretty, this spots my x spot, can't dodge the red dot, smoking the lala,\r\nCan't get no higher, where is me iya? she sends me fire, where is me lighter, look at me ice-uh,\r\nStep up your neckpiece, I like your wife-uh, I pack a rifle, I love me life-uh,\r\nPut up your hands before, I put up my rifle.\n\n[Hook]\n\r\nWhat's up nigga wut it do, I'm good my nigga how are you, half a chicken, whole chicken, quarter chicken\r\nWhat it move? Bentley coupe on bentley shoes, hell na them ain't 22's, still keep coke in inner tubes,\r\nPlotting on my next buissness move, 26 inch tennis shoes, old school paint it maserati blue,\r\nBrought my gun, but forgot my roof, pulling up with your baby boo, ooh ooh it's you know who,\r\nIt's nascar baby what you gonna do, looking for something thick I can screw, paint change\r\nAnd my diamonds too, trap nigga watch reminding you, my grill and ring be blinding you,\r\nIf you a stubborn artist I'm signing you, I'm still the same nigga that be shining too,\r\nTrap nigga, watch reminding you, my grill and ring be blinding you,\r\nIf you a stubborn artist I'm signing you, I'm still the black nigga that be shining too bitch.\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_5273774/su_0/rs_0/tr_3vUCAG_KUagDQ944WQnDWFyxJkwSUrLVB_MTEhuwn9CBuz-oWnPYfYLz22njL78blSE2pxgGguWk7c_jjrBbk5-NCpl_6ellpJZPXMUn-1VdNiRkMfoYq6hJwA-kC74dvQktTEsPZh_xbGU4nJo4kWCqzkdpSs4QUtgAQkAAEssowosmEdFCp_7oW2Hjjs6v3y4ZSSSnKXb5XFMe4-frkHIxJtkNgHMs_-MqLNBG-z_6gr2IjMMxyFrfeHcI_Q1_-81RWZ4N2QSJvoUsSkJ9j1QFtoL6REfdLm5XKoSlCwS6vRR2UaDir-IXwUZfa1aGiutQC0nBxIAA3jXpXAMwlwy_ZP8-8rhGYIaYAZRrAKSTGJBUmoY0tNR23bS395srRwD6yqNNSu8jTdKeaSWaM0bqWC2GCt6hkDeodVK_OYT4hoqrANebcSjnJmBIJrgwxZSTCQ/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\nWriter(s): Xavier L. Dotson, Xavier Dotson, Radric Davis\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nalbum: \"Trap-A-Thon\" (2007)\nBig Cat (Intro)\nBling Bling\nRe-Up\nBig Cat's Home\nFreaky Gurl\nWhat They Do\nAw-Man\nGood News & Bad News\nChoppa Shoppin'\nBad Guys\nPillz (Remix)\nSpanish Plug\nProduct\nBosses Speak\nFreaky Gurl (Remix)\n2 Screws Loose\n\n\n\n\n\n\n Search", 
  "title": "Spanish Plug Lyrics | AZLyrics.com", 
  "year": "2007"
}