{
  "album": "Trap-A-Thon", 
  "lyrics": "\"What They Do\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"What They Do\"\n(feat. Khia, Young Snead)\n\n\n\n[Intro: Gucci Mane (Khia)]\n(Thug Misses in the house!)\nGeah! Gucci Mane in the house\nGucci Mane, Laflare\n(This is Big Cat reppin)\nBig Cat in the building, so watch yo' mouth\nSo watch yo' mouth - tell me what they do?\n(Tell me what they do?) Shawty what you doin?\nShawty what? Throw it up\n(Oh you want me over there?)\nTell me what they do? (Tell me what they do?)\n\n[Chorus: repeat 2X]\nWhat they do? What they do?\nThey get drunk and they get loose\nMix that Goose with Absolute\nThen they turn to prostitutes\n\n[Khia]\n(Tell me what they do?)\nThug Misses and I'm lookin for a Thug Mister\nBig spender, break bread like a real mister\nDrop low to your knees boy, whistle on it\nThen put that wood on me, cut me like you paid for it\nIt's on you, let me know if you really want it\nYou on Goose, so I know you gon' get loose\nPop a pill, do what you been wantin to do\nThen make it rain like a motherfuckin hurricane\nI hate lames, if you want it you gotta suck on it\nGet it right, if you want it you gotta bid on it\nReal thick and my sugar got gold on it\nSpend on it, make a chick put her friend on it\nGood neck, good back, ohh yeah I want it!!\nSlide on it, make a chick wanna ride on it\nHair on it mean the nigga ain't scared of it\nThug Misses, Gucci Mane and you still want it\n\n[Chorus]\n\n[Gucci Mane]\nTell me what they do?\nFor about a hundred dollars she'll let you come through\nTwo hundred dollars take her clothes off too\nThree hundred she'll be all on you\nFor the fo' give a blowjob 'til she turn blue\nFive hundred dollars she'll eat a girl too\nDrop the whole stack she'll do the whole crew\nHoes get loose when they drink Grey Goose\nSeee the Coupe on rims with the big sunroof\nYou can bring your friend and your homegirl too\nDamn what you heard, baby girl it ain't true\nI don't like her girl I really like you\nCause she already told me what she wan' do\nLove it when you fresh and you wear perfume\nEverybody stare when I walk in the room\nChain frostbit like a New Year's Eve\nBut the watch on fire like the first day of June\n\n[Khia]\nLet me show you what a real boss chick do\nMake you feel real special when I'm on you\nSlide low lay back and enjoy the ride\nSuper wet stay gushin on the inside\nWater flowin like a stream call me Aquafina\nA real bad mamma jammer, love it when you beat it\nStay fresh, stay tight, pumpin all night\nI got that comeback, strokin on it just right\nGuys we can play hard if you want to\nAct like you don't want it when you know you do\nIt's real simple, use your lips then use your chin\nTip that pole back, baby sip on all the milk\nFruity Pebbles lips tastin like Fruit Loops\nLovin what you do when you gone on the Goose\nYou love it what I'm doin when I'm gone on the Goose\nYou gettin crunk and loose, good to know you suck it too\n\n[Chorus]\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_7442192/su_0/rs_0/tr_3vUCAFzoBJ-p2nRX6gjLDXpP6kHLTE4faxO1VVAvmt9Woa3iGx4o_4D5ISCqVr7UNj7qvu4_HBm6uRJkKnoewkBkzSjqfROEkK743CFRfvyDb2xi_ESfBX907ntazQAGyLXlFv1EfuoW4M0L-bjolp3OVnFJpbBb-MK9BhDQLKDAeh9oxYR2mr_13heeJM95GkrmMazmBl6V_mrm9dGycA-eZGFpNQhyMqQ7XmZmHu57pDyGAaO7nnailyhLtF1AJyKLZuzBpJEE6o8tmZ4yFfGRXPUFOAD6Aim-vsRyqLHuwk4CyYo22KNh-52iIkEFllMv3kZsB2l6OH_BEOvvOjRKDZmFY1FMXdWUbcEW3GLroDggx13KJngrgSqF6lUx8d1503VLmWC1wJax7uBvFo-PHiK04c6uPcIhwXiwxsPJovH6XFXTv3nA_eda75rqR2I8yqLF_dArRyQuDSHTdsxiNI_-QtS-Jwal3Vx0xg/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nalbum: \"Trap-A-Thon\" (2007)\nBig Cat (Intro)\nBling Bling\nRe-Up\nBig Cat's Home\nFreaky Gurl\nWhat They Do\nAw-Man\nGood News & Bad News\nChoppa Shoppin'\nBad Guys\nPillz (Remix)\nSpanish Plug\nProduct\nBosses Speak\nFreaky Gurl (Remix)\n2 Screws Loose\n\n\n\n\n\n\n Search", 
  "title": "What They Do Lyrics | AZLyrics.com", 
  "year": "2007"
}