{
  "album": "The State Vs. Radric Davis", 
  "lyrics": "\"Volume\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Volume\"\n(feat. Wooh da Kid)\n\n\n\r\nGucci, scoochie,\nOK, paper out, paper out\n\n[Hook:]\nI'm so motherfucking turned up right now (volume)\nSomeone please turn Gucci Mane down (volume)\nBricksquad thugged out, we don't give a fuck (volume)\nWe hit the club, shoot the club, tear the club up (volume)\nSo you should hit the floor, get low and shut up (volume)\nHit the floor, get low and shut the fuck up (volume)\nYous a bitch, yous a snitch, you a motherfucking scrub (volume)\nYous a bitch, yous a snitch, you a motherfucking scrub (volume)\n\n[Verse 1]\nI pulled up in a four door Porsche set tripping\nThree young dread head niggas riding with me\nI don't think they like me and I don't like 'em neither\nBut if they move wrong I'll red up they white beater\nI do it for the hood, I do it like no equal\nI do it for the red, black, yellow, white people\nI just bought a kay, just the other day\nAnd I don't play with grown men I don't like to play\nI'm so motherfucking turned up right now\nNiggas hating on me, I don't give a fuck right now\nWell, you niggas keep on trying like the little engine that could\nYou think you can, you think you could, I think you pussies should\n\n[Hook]\n\n[Verse 2]\nCall me Gucci flocka flame, I then changed my name\nCall me frenchie mane, la flare, gucc the kid -- it's all the same\nI be running, gunning, stunting with 100 killers riding\nYou snitching, bitching, tattle telling scared to stand beside me\nI just bought another house just to hold my goons\nSo icy entertainment boy we just like a platoon\nThe colors in my chain remind me of a cartoon\nI'll murk your boy in March baby find that boy the June\nI wish they found him August so that's like tomuch too soon\nHis face was swoll and puffy about the color of a prune\nBricksquad movement and no you're not a part of it\nMe waka and woo juice and frenchie mane started it\n\n[Hook]\n\n[Verse 3 - Wooh da Kid:]\nIced out bar, got me balling like the lakers\nHomicide around the corner where you in Jamaica\nMy volume on max, you boys better run\nIma nigga with an attitude holding on the gun\n17 niggas I left 16 hit, last nigga hit the corner, got his whole head split\nTold you you're a goner, ima leave you dead quick\nI'm like asalam-aleikum, left them ... prick\nWooh, the kid thugged out, we don't give a fuck\nLet your soul meet the sole of the bottom of my chucks\nBlack car, black tint with the big tags, stay low to the floor\nMy midget out bag, my midget out the bag\n\n[Hook]\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_2168649/su_0/rs_0/tr_3vUCAG9tDYvdCm2TzXbrFHV6-rb5ZY9wxHXJIljgDCnHSVO2of0d4eppSb040Azt1oclAPp0eohszuLPk_oHknLYU_198Gc8vec1YBAYyhHRj1rQ1BlFETNiiNKjBRf9XzX-ZfUkljDGjdcVTlGt8z891kUKsR4ieF8gfy5SpsMm7Isc-ZKwqB2pYcJiGnVkS0MKNd_C59VrmtndqZ1PW0nH8betUKCNK3dMhlxkeH7_gduUPcBIpHgQJ1allHwpzyHTHsKHTPH8Xt1aBoPL6B8p2F8n8SpsqLZh2b0l7s-EnCoMNzJxcjr-NfKKQ7HBxWyvZX0o6oOomi5FRjax3k37TWqFQrrLWg2qKA-kMsnycd5lDda1y4mfylNH88nTsbVHKiIWSoJV4h9IMvxQAKLclqGFU_YJWJyUjMowrvTEOJ4MVuRv6Rzik5b6O4UFdGmkOZ0aPA0uxZXB43bcMOU/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\nThanks to Dylan, Justin for correcting these lyrics.\n\n\n\n\n\nWriter(s): Davis Radric Delantic, Malphurs Nyquan\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nalbum: \"The State Vs. Radric Davis\" (2009)\nClassical (Intro)\nInterlude #1: Toilet Bowl Shawty\nHeavy\nStupid Wild\nAll About The Money\nLemonade\nBingo\nSpotlight\nI Think I'm In Love\nBad Bad Bad\nInterlude #2: Toilet Bowl Shawty\nSex In Crazy Places\nThe Movie\nVolume\nGingerbread Man\nWasted\nKush Is My Cologne\nWorst Enemy\nInterlude #3: Toilet Bowl Shawty\nWasted (Remix)\n\n\n\n\n\n\n Search", 
  "title": "Volume Lyrics | AZLyrics.com", 
  "year": "2009"
}