{
  "album": "Brick Factory II", 
  "lyrics": "\"Da Gun\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Da Gun\"\n(feat. Cash Out & Waka Floka)\n\n\n\n[Verse 1: Gucci Mane]\nYou keep talkin' that shit, muhfucka\nYou'll make me mad, I'm a get my cutter\nGet my M16, my Mack 11, my K, I'm a call my brother\nMatter fact, I don't need no 'nother\nNigga, I ain't even gotta call my brother\nThis lil chopper gon' take care of all that drama\n17, I don't need no mother\nI got pain, I killed the pen and I killed the paint job\nRocket launcher, crazy gun like in Super Contra\nKangaroo pouch with the strap, it's down on the nat\nSatellite dish, turtle top though, cowabunga\nGot them black shades, can't see shit, Stevie Wonder\nAnd I'll shoot a nigga in his shit, you better run, bruh\n\"Gucci got a gun, he 'bout to click, better run swift\"\nI just wanna shoot, don't wanna hit, got a four fifth\nMy niggas'll shoot yo' ass for shit, that like 4-6\nMac 11, don't keep it at home, got it right here\n\n[Hook: Gucci Mane]\nBag full of guns, let me pick out one\nWhomever wanna test, let that bad man come\nWho wanna war? Let come, bet the game begun\nBecause I murk niggas for fun, man, I kill for fun, for fun\nFlocka got a gun, please put down the gun\nGucci got a gun, please put down the gun\nFlocka got a gun, please put down the gun\nGucci got a gun, please put down ya gun!\n\n[Verse 2: Waka Flocka Flame]\n.38s,.45s, Glock 9s, pistol in my hand, I don't do the waistline\nHeart all black, Akon, how you gettin' money but can't make bond?\nSilencers on the chopsticks, Avon - I got a lot of guns\nBig guns like Contra that'll shell shock you like Blanka\nShooter save a shooter, I'm a top shotter\nWaka Flocka Flame, I got the juice, partner\nLow jolt the gun, that's the anaconda\nFuck the law until they free my partner\nChopper kick like Liu Kang, free Poo Tang, who who bang?\nYou real then I'm recruitin', you a dead man with' that FN in my hand\nDon't fuck with' niggas, Ku Klux Klan, get love all in the Motherland\nMake ya best friend kill you for the bands, get love all in Rosecrans\nGot a Mack 10, AK, SK,.223, 3 throwaways, that's a 40, real P-Funk\nSlow him down like a speed bump, the barrel pump, Elmer Fudd\nWhoever thugs, I'll leave ya slumped, show you no love\nI'm shinin' hard, Michael Jackson glove\nBrick Squad, there's too many guns, shoot for fun, just because\nKill a nigga, kill a nigga, kill a nigga, kill a nigga, Squad!\n\n[Hook]\n\n[Verse 3: Ca$h Out]\nCa$h Out got a gun, put ya hands up\nThey say they want war, put ya bands up\nI buy these niggas' partners, make 'em hit they mans up\nAnd these niggas snitchin', that's why they takin' a stand, bruh\nJewels 'round my neck, ridin' by myself\nPistol on my hip just in case a nigga wanna trip\nAnd I don't need no crew\nThem the niggas that's snitchin' on you\nJust a couple real niggas 'round me\nWho don't give a fuck about you, ooh\nThese niggas know I hang around them shottas\nOnly comin' for ya medulla oblongata\nWanna see yo' noodles, love eatin' pasta\n(I'm on the phone with' Mac A Zoe, he put me on the roster)\nYeah, we talkin' crazy, in Miami in a rari with' them Haitians\nShit, I just talk it how I live it\nProbably that's the reason why I party at Liv, rich nigga shit\n\n[Hook]\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_14853958/su_0/rs_0/tr_3vUCAOld70olMGTRDcuwUIy06gvkEDxCLUwqtFS1rgejQG6zwCqepiYegqq8Y9-P7WBe950taaM4iJKEfbDHVc4ByCACkKl_vhP3kYjJBfHhxh1Y06s6oDlfkoDG5mUgQf5A7hLmMbTm4lNh1nVD6uZlVUDLaynk4_p44mjYjrFRdCdeXs9rEwu907ZxkLiqPKjiphX61O9GHFKmEPxcE3pm3Uyr9yf7B9W4H8RDUeTR-xzmdG_6kZ0h4cKyrgJT4lKCEovP8zaZRpzxu22G3MUBQxavy1f9P-Pl5PvCPVC5gaDpW6r5U4BFkI5vIm7yBAP1LgChL3UFFUep8y-tfNmpCc4dfDYULgPlpvxEva1c2Lft6I6GUywHcvaiFxlo_aZhlHMmYpdALFpN4Yjjll58iVaCoFqy3ud6IJobiW4DMfauIJDXna-QKqanz8vBf1L6x8itmESnxA0yxp1hwECT9hVdbPxk_eskXg/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nmixtape: \"Brick Factory II\" (2014)\nLaundry Mat\nDa Gun\nTake My Life\nHell U Talking Bout\nPourin\nOn The Way\nReplay (Skit)\nDown & Out\nExcuse Me\nCatch A Box\n\n\n\n\n\n\n Search", 
  "title": "Da Gun Lyrics | AZLyrics.com", 
  "year": "2014"
}