{
  "album": "Brick Factory II", 
  "lyrics": "\"On The Way\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"On The Way\"\n(feat. Young Thu & MPA Duke)\n\n\n\n[Hook: MPA Duke]\nMy country boys on the way, I'm finna serve 'em\nI want you to hold this K, and don't act nervous\nGot them goons around me, and they workin'\nWe gettin' them birds in, and that's for certain\nHe claim that he a boss but he never took a loss\nPlayin' both sides, that's the shit'll get yo' ass offed\nGot some shooters on the buggy, they'll kill yo' ass for nothin'\nRun up on you wit' that carbon, empty clip into his necklace\nThey vicious!\n\n[Verse 1: Young Thug]\nThem bitches naked washin' dishes\nShe like my lifestyle, she say we live too relentless\nTwo thousand for my Gators, them bitches look itchy\nBitches got bunks and I'm rich like Donald Trump\nRidin' round wit' that pump, pockets look like a lump\nWeed smellin' like skunk, blunts big as a stump\nBitches wan' fuck Young Thug and they wanna fuck uncle unc\nThugger not wit' the bullshit, baby, I just want fun\nBallin' all in the lobby, baby, I came up on midgets\nNah, we not gettin' pulled over but my whole crew got them tickets\nBaby, I'm YSL, I know you come to the funeral\nNah, I'm not psychic but I got powers just like Yu-Gi-Oh!\n\n[Hook]\n\n[Verse 2: MPA Duke]\nI'm in the front of the line like the muhfuckin' hearse do\nI know Thugga killed verse 1, I'm bout to kill verse 2\nDK in the new Ferrari, damn, we ridin' round the lobby\nWe so high off life, and we ain't got no fuckin' options\nReel them ducks in, we call it goin' fishin'\nWashin' machine all that money, we call it cleanin' dishes\nMakin' birds take a bath, we call it shavin' pigeons\nAnd I ain't PeeWee Longway but ya ho know I'm dealin'\nSwear I'm cold-hearted, I don't got no feelings\nIn that new drop top, I don't got no ceiling\nThe roof is absent, ball like I got cancer\nI'm the man in Atlanta, ask yo' favorite dancer\n\n[Hook]\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/DFd9gOgOCmSkm2rJwzJTH0h7MhmH9tbW/24pKHf8q53RR2n8vE0b0h4eyM+2npkkedcgqcCJRqS4JqCZdim0I0UIPD9sjLz+jw0h2a2hSLXlCJt9G8wR2nHjqVb+yG3QvgWBZ3VYhX1bqUk1UAyQtlGHOlGLdPfhr2yuHrLLPqM=/?artist_name=Gucci+Mane&track_name=On+The+Way&s=943c7387eaf0f743d103fdbed2940aba\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nmixtape: \"Brick Factory II\" (2014)\nLaundry Mat\nDa Gun\nTake My Life\nHell U Talking Bout\nPourin\nOn The Way\nReplay (Skit)\nDown & Out\nExcuse Me\nCatch A Box\n\n\n\n\n\n\n Search", 
  "title": "On The Way Lyrics | AZLyrics.com", 
  "year": "2014"
}