{
  "album": "The State vs. Radric Davis II: The Caged Bird Sings", 
  "lyrics": "\"Threw With That Shit\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Threw With That Shit\"\n\n\n\n[Verse 1: Gucci Mane]\nGucci! Gucci\nAll these diamonds on me, they dancing on me\nShe glancing like I'm a star\nThese Giuseppe's on me, they stepping on me\nSo I might just stand on the bar\nGot this weapon on me don't help me homie\nIn the parking lot I'm a star\nPut my Bentley to your sentra nigga\nIt's like a bird just shit on your car\nGot 3 birds strapped to your pa\nAnd I might be wearing his [?]\nIf he don't pay when I tell him to then I'm kidnapping your ma'\nGot them white diamonds, no flaw\nGot that bad bitch with no bra\nAnd if you know what these tear drops mean\nThen what the fuck you trying me for?\n\n[Hook: Gucci Mane]\nI done showed this bitch too much too quick\nSo I can't cut her off that's foolishness\nShe tell on me, it's over with\nMan I don't even want nothing to do with this bitch\nOne more run and I'm through with this shit\nI don't even want nothing to do with this shit\nAll this cash I'm sick of this shit It's midnight mane [?]\nI pour a deuce in 20 juices I swear I'm a fool with this shit\nBut I ain't drinking lean no more I swear I'm through with this shit\nI smoke so many blunts of kush I man I'm a fool with this shit\nBut I ain't smoking that shit no more man I'm through with this shit\nI fucked so many different bitches I'm a fool with this shit\nBut I ain't fucking with these hoes no more I'm through with this shit\nSo many diamonds on me I done caught the flu with this shit\nBut I ain't buying that shit no more man I'm through with this shit\n\n[Verse 2: Gucci Mane]\nAin't no flexing on me, it's a blessing homie\nGot a collar shirt with a diamond resting on it\nAt the concert stressing that your pressing on me\nAnd they damn near had to bring a stretcher homie\nAt the western homie and your girl is one me\nAnd the girl so cool she brought and extra homie\nGirl on girl no question homie\nDamn I swear that shit was a pressure moment\nFuturistic ride like a Jetson homie\nGot the Forgiato rims with the F's on em'\nSummer come out they put the dresses on\nAnd the bitch so fine I put a necklace on her\nGot a bitch that call me super sport\nShe say all my cars got S's on em'\nShout to Bun, you a legend homie\nDid a verse for me, now I got Texas on me\n\n[Hook: Gucci Mane]\n\n[Verse 3: Gucci Mane]\nI'm through with this shit and I'm through with this shit\nCause' I know that one of these niggas might snitch\nWhich one of y'all gonna be a little bitch?\nWhich one you young niggas wanna get rich?\nDropped out of school but he got a little sense\nWanna get rich? Gotta take that risk\nGotta work yo' bitch, gotta work your wrist\nGotta use good sense, gotta sell that fish\nIf you shit where you piss then it don't make sense\nSelling bricks with a bitch then it don't make sense\nThey were friends til the end then you snitched on a friend?\nWell a friend tells the truth and you're not my friend\nIf niggas were real then niggas will win\nI never put trust in these niggas again\nHow you my clan you and didn't stick to the plan?\nYou say you a man but you told on your man?\nSammy the boo man you know what you did\nSnitched on them all just to show off to yo bitch\n2 shots in the head for the shit that you did\nYou say you OG but you talk to the feds\nJudas betray me, you gave me this bread\nAll the time you had dope planted on edge\nThe city infested man, watch for the plague\nWatch for the rest and look out the pigs\n\n[Hook: Gucci Mane]\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_9126602/su_0/rs_0/tr_3vUCAJvsxczXiTa12KCjvkBHrfP1VFpysJnNehSPJPD-Zn8DNlOpHqrFyOrp8t4NZGb0PIf18hkcibSlBMHsRUKa5qBOPJ0g55-37d6XG-ELplYqFKjZK8jIUZ7ckb_4DDjpigpnvxLkfekra_d6IlQj7xMioE5PkdWAz6HLCuVOnI3PcpNw_wlfFmc89WLgNdMXfrZrDHV55AhL7FWMqnB7_GLM_dEOZa09PaLfiqp0d33eai8bVstzZX_xYfdAq45fNt5vY5jKE67XSLRh6xCgVmzQSrRIivlg8kfOXEIOegtj5X2OFrTVp-Yx4QKyK1f9JRJG-Xq40XU86IMBG2GJmRxuS1LKt8i-RL0RhCa-nyNeoaE5ko-HQ3xnJTHm3wUZQzTUtqvWzaHd-YvEvYMYpCZ8-B-nKmjFmj1vKJ84qPF0Zs7Ck_Dl2q1p898_xl-kDnNBDCdKs26M/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nalbum: \"The State vs. Radric Davis II: The Caged Bird Sings\" (2013)\nPull Up On Ya\nJackie Chan\n#Mentionme\nRude\nBirdman\nDouble\nBad Bitch\nTell Me Nothing\nToo Many\nWish You Was Me\nIce Cold\nFugitive\nFeets\nButtnaked\nAny Thing\nDo It\nThrew With That Shit\n\n\n\n\n\n\n Search", 
  "title": "Threw With That Shit Lyrics | AZLyrics.com", 
  "year": "2013"
}