{
  "album": "Ferrari Boyz", 
  "lyrics": "\"In My Business\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"In My Business\"\n(with Waka Flocka Flame, feat. Rocko)\n\n\n\n[Intro/Chorus]\nYeah I stay busy, stay out my business\nCause I ride Benzes, ay that's my business\nSee all my lenses, are dark blue tinted\nCause I don't LIKE people in my business\nIn my business, I run my business\nIf ain't 'bout business, then I'm not listenin\nIn my business, I run my business\nIf ain't 'bout business, then I'm not listenin\n\n[Gucci Mane]\nIf it ain't 'bout paper, there ain't no convo\nSee I ride scrapers, and y'all ride Volvos\nBut that's my M.O., I go where you won't go\nI smoke what you cain't smoke, I'm rich and you're flat broke\nSee I'm not a blogger, and I'm not a jogger\nI'm more like a mobster, just call me a baller\nA Chevy Impala, sittin on them 40 O's\nI got a lot of things but I owe 'em to Sergio\nGucci's a hustler, and he got clientele\nAlways got somethin to sell, just pullin your coattail\nYou hate me then oh well, I checked out a hotel\nBut now I get fan mail, my game at a stansstill\nI checked out a hotel, you hate me then oh well\nBut now I get fan mail, my game at a standstill\nGo spin like a windmill, I lower than windshield\nSee I got a good deal, but know what the hood feel\n\n[Chorus]\n\n[Waka Flocka Flame]\nAll I know, I'm one real nigga (Flocka)\nGrew up 'round robberies and drug dealers\nDutches no Swishers, I'm the new God Fisher\nCan't be Nino Brown cause that fuck nigga snitchin\nCatch me on the Grove, chillin where it count\nIt's not just metaphors, pussy nigga you don't trap\nWhy they in my business? My name rang bells all through prison\nThey run up in my house cause they heard a nigga pitchin\nBitch that's my decision! Why you worryin 'bout me?\n24 years old, I'm a fuckin O.G.\nRiveralde in this bitch, young and rich, macaroni bitch\nTwo-door 6 B watch me shift, touchdown ref get off my dick\nMiddle finger when I see the (folk) fuck police\nI got your salary hangin off my neckpiece\nAnd to every nigga don't like me may you rest in piece\nWhen I die label me a motherfuckin beast\n\n[Chorus]\n\n[Rocko]\nUhh uhh, they goin for 30, just sold 20\nGot pajamas on, and I still feel like money\n(This what I do!) Tied this down, my new hoes 20\nThe Beemer made me look 30, the Benz on 20's\nHell she talkin businee and lookin for it, you got any?\nThe L stash smash well hurry hurry bring plenty\n(Bring it all) The full truck gank came we hungry in the streets\nThis dry town ain't rained for weeks\nI'm still posted in the paint, try and stay on my pivot\nI might travel in a minute, they better hurry and send it\n(I'ma come get it) We independent, you talkin business nigga I'm listenin\nA couple of commisary digits nigga to talk business\n\n[Chorus]\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_7358698/su_0/rs_0/tr_3vUCAAh_5N2NfBV9dIoAxIIWXM8aQ7yeKGMGNB8Hwont1AhSrkYA7Ub-N2r6QxZG0RTvBnBM3JdOaPPhSg8Rap8eS59Tm_g4V8ipFlO0R1xtDKkamCuBxZegBZbzrVBAooQdunnJO8XVfTmcMGzcmUABzCrJ7ETTMpNuQ-LBdmg8iKHBI3q64W3on4Igh0CoAE3CbkJvwxrm78GZgQJWNPFwb-HLlY18b2qslD2fgNaIL3b1Rb48zrROnlIUICJ8-QMm5yy0X5_-7zxcLZyQ_emhYsvgL5oosDEDyKgeBCt69LyjVBvXRja5unSN13cfsxtwxMsS3hby80l3yrFJWum9WwZsqpowvfE88cSMd_FURqCeeX_SSSPR3N1aA1MM7AvfKhh1d5x67HVko3saHYVfUJxfG63kUg5ZHU2MxCdLORWIbZ05wA3RVsqopmt80Hv6xQlNBs8HMCDjuLXdnt7krZi1w7zXg3x5QYfgU5o/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\nWriter(s): Stewart Demetrius L, Unknown Writers, Richardson Dwayne\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nalbum: \"Ferrari Boyz\" (2011)\nFerrari Boyz\n15th And The 1st\nBreak Her\nFeed Me\nMud Musik\nIn My Business\nYoung Niggas\nSuicide Homicide\nPacMan\nStoned\nShe Be Puttin' On\nSo Many Things\nToo Loyal\n\n\n\n\n\n\n Search", 
  "title": "In My Business Lyrics | AZLyrics.com", 
  "year": "2011"
}