{
  "album": "Back To The Trap House", 
  "lyrics": "\"I Might Be\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"I Might Be\"\n\n\n\r\nIs you rollin? [x4]\r\nBitch I might be [x2]\n\r\nGirl he geeked up\r\nGirl he geeked up\r\nBitch I might be [x4]\n\n[Verse 1:]\r\nEast Atlanta slum man is where I come from\r\nPass that bubble thrax and put this bean on your tongue\r\nNow everything was gravy til your bitch came in\r\nBout the same time that that thang kicked in\r\nNow she ain't really pretty but she got a nice body\r\nI'm geeked up thinkin this Buffie The Body\r\nAin't your name lil Trina cause you look like Janet Jackson\r\nI'm off three double stacks and I'm lookin for that action\r\nGucci Mane you stupid man I love the way you flowin\r\nRidin in my drop but I don't know where I'm goin\r\nOn two eighty five I keep ridin in a circle\r\nThe inside of my ride smellin like a pound of purple\r\nGucci is your time give me five more minutes and a cold orange juice cause I'm really really trippin\r\nWent to the strip club and request that I'm da man\r\nThe next thing you know I was throwin rubberbands\n\n[Chorus]\n\n[Verse 2:]\r\nShawty tellin me she ain't neva suck no dick\r\nNeva took a pill or neva ate a bitch\r\nYou a lie but I ain't gonna get upset right now\r\nBut I wish I had a lie detector test right now\r\nYou say you marry well bitch you might be\r\nBut I bet your husband ain't Icy like me\r\nShe stand on B.C. in my ashy black tee\r\nWhen dem dope man nikes and dem jore ass jeans-Jordache Jeans\r\nI don't pay her but I still keep that thrax on me\r\nI'm a the shit in East Atlanta baby ask about me\r\nPop one pop two two halves that's three\r\nAin't no waffle house baby hell I can't eat\r\nGucci hood like your hoodman hes so extreme\r\nWearin doces in the club cause you kno the boy geeked\r\nTop the top on that thang let you see my seats\r\nWe've been rollin rollin rollin we ain't slept in weeks\n\n[Chorus]\n\n[Verse 3:]\r\nGucci Mane the flyy nigga get your mind right\r\nOr a crys by the twelve like a case of budlight\r\nSell a cush by a bell so you kno might shit tight\r\nSee I'm 30 in the morning on a all night flight\r\nI'm high like Fabo hood like Shawty\r\nSo tell me when to go like my name E-40\r\nA rich rock star nigga I'm gonna party\r\nGot a party pack of pillz that's at least bout 40\r\nI'll pour dem in your hand like a bag of jelly beans\r\nTake two of these pillz call me in the morning\r\nFifty thousand pillz man I'm so real\r\nThree dollars for a pill that's a damn good deal\n\n[Chorus]\n\r\nAy wassup Gucci Mane. Why you sweatin so hard? Is you rollin or somethin.\r\nShit well baby I might be. But got damn what is you doin. You jockin a playa.\r\nYou ch-Chewy ova here right. Look I ain't\r\n(K-Reilly) K-Rab baby You know what I mean I'm not a piece of Bubblegum.\r\nWhat I'm doin is not your business. But matta of fact while you ova here is you a waitress or somethin?\r\nCause the shit you got on make you look like you a waitress.\r\nSo do what you do iight. I'm a give you this hundred dollars.\r\nGo get you what ever you drankin.\r\nBring me and click about ten of dem orange juices, five crunk juices nd we'll be straight how bout that.\r\nAnd is you straight is you single or is you marry.\r\nCause I might be, Bitch I might be, Bitch I might be, Bitch I might be\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_6137714/su_0/rs_0/tr_3vUCACNCd9S8vXjMJgdMg2kVgMXWAEWrPdhG07GWFd0XFtDWYOEXtayEiPnhvsKZduhRZSX1M3v5FYxnk_E4BtubssHT6OWBrbpsNf6e1loI_fFp4--YlNMvnBKV2Hr7TXENcnV4Uacp2tgymTC8JN9DE9vR4YzVKu6gHuEDSO_SfMb41Ew6ZUjTR_iKH0ZQSu-7d_aShynd7IB056thXYLOmHuf8EW8HuXvqknquNCGSZJpQ5nsF4X9h8aEmn9wC6K2ix0Seqx0SsDmJ0EE-StjpYkOS1T13yimPERajw0uXEELYI9i0ntdNzy0MiXYMFcI12QM0iki0Q5SjB-DobDQ9QUKn7qN_7dUztwxBbk-xeQIrmj0fB8cfrV-0thpC7L_S0V59u-tT0UHyHRSuZ1M_YY9VkhO_ptdNtEiJGBbJxs0LPkKEKN1eF4vIiN0AOqELk3jRrHY_vvWkVt-JREAvuD0ux2QJHcA/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nalbum: \"Back To The Trap House\" (2007)\nFreaky Gurl (Remix)\n16 Fever\n15 Minutes Past The Diamond\nI Know Why\nI Might Be\nWhat I'm Talking Bout\nBird Flu\nDrink It Straight\nJump The Line\nG-Love (You Don't Love Me)\nStash House\nI'm Cool\nI Move Chickens\nBallers\n\n\n\n\n\n\n Search", 
  "title": "I Might Be Lyrics | AZLyrics.com", 
  "year": "2007"
}