{
  "album": "Diary Of A Trap God", 
  "lyrics": "\"Nights Like This\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Nights Like This\"\n(feat. Waka Flocka)\n\n\n\n[Gucci Mane:]\nNight like this, on a night like this\nOn a night like this? On a night like this\nOn a night like this? On a night like this\nOn a night like this? On a night like this\n\nMight get that on a night like this, get car-jacked on a night like this\nI don't wanna dap, but you know I wanna scrap, and you might get whacked on a night like this\nOn a night like this? Yeah my nigga on a night like this\nOn a night like this...\n\nOn a night like this a nigga might get killed, whack that nigga, give his ass the whole clip\nMight send a bitch to attract that nigga. Tease that nigga. Distract that nigga\nRan off on the third, get killed on the fifth. Hit him in the head with the damn four-fifth\nLater in the club he was smoking that piff', shot him in the head he ain't leave no tip\nGot my lean in the car, (you) can't take no sip. Can't lean, can't walk, can't crawl, can't limp\nOne of them nights when you don't get right, don't fix your face then your ass get killed\nThat's what you get trynna act all stiff, coming up the hill too swift I'll rip one\nBlood or a crip, (don't) give a damn. I'll hit one. If you don't got a gun, then you better go get one\nOne of them nights when I don't wanna fight, put your hands on me, and I'm ending your life\nSay it to my left, cause you know it ain't right. Call me Tyronne, cause I know I ain't right\nI'm the type of nigga that get in a fight, by the end of the night they'll be reading my rights\nI got the right to shoot your ass on sight, I got the right to put an end to your life\nIf they rob you once, they'll rob you twice. You a pussy ass nigga, you ain't bout that life\n\nOn a night like this, on a night like this\nOn a night like this, man a nigga killed on a night like this\nOn a night like this, on a night like this\nOn a night like this, I'll kidnap your wife on a night like this\nCar-jack me a nigga on a night like this, on a night like this\nMight whack me a nigga on a night like this, on a night like this\nPut some goons on a nigga, they'll be in your house on a night like this\n\n[Waka Flocka:]\nUh huh (where he at? where he at?), on a night like this you could lose your life\nUh huh (where he at? where he at?), on a night like this you could lose your life\nMost my niggas rock red, some rock blue. Backdoor a nigga, leave him sick: bird-flu\nSell it in the two's, next flip by a coupe. You saying fuck me? Nah pussy nigga, fuck you\nI'm still the same nigga on the blocks selling rocks, rule number 1 - don't fuck with the cops\n50 for a show, 80,000 for the watch. I'm a real game spitter, shawty slicker than a fox\nWith a phone call, boy I could get you hit. My niggas hold pistols like they legit\nSend them killers at your ass, better hope they miss. You ain't bout that life, you just pop this shit\nI could see through the mist, shawty snakes in the grass. Dropped out of school, still above my class\nReal right now, even realer in my past. You don't like what I've become, shawty kiss my ass\nI'm my own boss, that's why these niggas mad. Phantom ghost, paid it off cash, that's why they mad\nHahah, SQUAD, SQUAD, SQUAD, FLOCKA!\n\n[Gucci Mane:]\nOn a night like this, on a night like this\nOn a night like this, man a nigga killed on a night like this\nOn a night like this, on a night like this\nOn a night like this, I'll kidnap your wife on a night like this\nCar-jack me a nigga on a night like this, on a night like this\nMight whack me a nigga on a night like this, on a night like this\nPut some goons on a nigga, they'll be in your house on a night like this\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_8211466/su_0/rs_0/tr_3vUCAFbHWtZzwUhY5fEW8A7nCUbwh9pOmFlhhH7a7-na-axA2HAC48gJ4n0mXwA1qDHPKZ_E7s2n4eoq5ewUvfY4xWUNyjdK9_BbWaKYmeV9_humyZenjL10WpY-PKsmRgY1oz96HVtT5IPbF2tbYyMYPVE6YM4oCd2KfrU_LpyXUcBpWqAOFEJDIhiowYMTPpICRgVJETsULutrvY44iD0FSPvEBViQA2k4v9Z72UkH-RaMIWMQXU5y3sgFwZ3OpJg9iE2Wp37GoNsvOKhnVFB_xAjZ_mDHr0Jf0WvwUELSpkC1DdGTBgTl_HFT9_-_q_NS3g3cKhxXQBZ-kyjZWW7uFRkzZhD1nOTwiZtG5IMwulOayFcKo5_bwvVOOAXGpRPLKNovJi5Ewb4Jsq7RLQSQkroP1K29PyrYgjZPmz_ds0nTmgDDeN3u_ik7q0gNcCEKu3fyxeFdmG6tDOsUskaZkqlD/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\nThanks to Giselle Galle for correcting these lyrics.\n\n\n\n\n\nWriter(s): Davis Radric Delantic, Mays Carlton D\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nmixtape: \"Diary Of A Trap God\" (2013)\nDecapitated\nMe\nCutters\nPablo\nI Heard\nCali\nKeep It Real\nPussy Wet\nShow A Young Nigga\nShe A Soldier\nHigh Power Cowards\nRecognize\nHalf\nNuthin On Ya\nNights Like This\nChoppers\nAll These Bitches\nVirgin\nStash House\nFall Back\nClub Swole\nCold Hearted\nRealest Ever Lived\n\n\n\n\n\n\n Search", 
  "title": "Nights Like This Lyrics | AZLyrics.com", 
  "year": "2013"
}