{
  "album": "Trap House", 
  "lyrics": "\"Go Head\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Go Head\"\n(feat. Mac Bre-Z)\n\n\n\n[Hook]\r\nGo Head, Go Head\r\nGo Head, Go Head\r\nGo Head, Go Head\r\nGo Head, Babygirl Go Head\r\nGo Head, Go Head\r\nGo Head, Go Head\r\nGo Head, Go Head\r\nGo Head\n\n[Chorus x2]\r\nShawtii gotta ass on ha (on ha)\r\nImma put my hands on ha (on ha)\r\nImma spend a couple grand on ha (on ha)\r\nImma pop a rubberband on ha (on ha)\n\n[Verse 1 - GUCCI MANE]\r\nIm tryna figure which chick imma see today (see today).\r\nPicked up a young gurl, looked like Lisa Ray (Lisa Ray).\r\nWhen I seen ha in da club said I gots to get ha (gots to get ha),\r\ncuz she look like she might be Trina sista (Trina sista).\r\nGotta gurl look just like Lauren Hill (Lauren Hill),\r\ntook ha to da crib cuz she kno' wut it is (she kno' wut it is).\r\nImma bump ha but I cant stand ha daddy do' (daddy do')\r\nbut she got mo' ass than Jackie O' (Jackie O').\r\nGotta brown skin gurl like Foxy Brown (Foxy Brown).\r\nBought a quarter pound just to blow it down (blow it down).\r\nTattoos all ova' like Eva or sumthin' (Eve or sumthin').\r\nLong hair but it must be weave or sumthin' (weave or sumthing').\r\nGotta spot so I bought ha new furniture (furniture),\r\ncuz she pretty in da face like Monica (Monica).\r\nI really dig da gurl so I gave a ticket to Gucci World (Gucci World).\n\n[Hook]\n\n[Chorus x2]\n\n[Verse 2 - Mac Bre-Z]\r\nIm in da club niggas screamin' who da hill is dat (who da hell is dat).\r\nDat gurl wit' dat ass all on da back.\r\nI got dat fire read thong wit' bra to match (bra to match).\r\nImma real boss bitch and im hard to catch.\r\nMac Bre-Z, pimpin aint E-Z nigga (it aint easy),\r\nyou can leave me cuz I don't really need ya nigga (I don't need ya).\r\nI got dat chevy and ya hear me fo'\r\nya see me nigga cuz my mama sho' da Mack how to treat a nigga.\r\nAnd imma Top Notch Bitch dat talk shit but I take none (I take none).\r\nHair stay fixed\r\nJump fresh wit my nails done (my nails done),\r\nmy braclet. My nigga sick so you already kno',\r\nwhen I step up in da club,\r\nI be rockin' stilettos hoe (stilettos hoe).\r\nImma jazzy gurl, straight classy gurl (straight classy girl).\r\nAnd ya never head a nigga say im nasty gurl (I aint nasty gurl).\r\nAnd ya never meet a gurl dat will shine like me (shine like me)\r\ncuz im wit da Gucci Mane, im SO ICEY.\n\n[Hook]\n\n[Chorus x2]\n\n[Verse 3 - GUCCI MANE]\r\nDem niggas jealous say you aint got time fo' dat (time fo' dat).\r\nAll dat shake can a nigga get some fries wit dat\r\n(fries wit dat). Too much ass, I aint gotta press a high to dat (high to dat).\r\nHair blonde fo' a minute til'\r\nshe dyed it black. In da club wit ha gurls, everybody pretty.\r\nSaid she used to dance at Magic City (Magic City).\r\nGo Gurl (Go Gurl)\r\nTo da flo' gurl (To da flo' gurl)\r\nShake it real slow like a pro gurl (Pro gurl)\r\nHit da dro gurl cuz its yo world (yo world)\r\nDance one time den get some mo' gurl (mo' gurl)\r\nGucci in the club two rubberband bites,\r\nsmokin' bubbagush and da shit just stank (stank).\r\nSix gurls dancin' at da same time (same time),\r\nnever seen a hood hoe so damn fine (so fine).\r\nTurn around babygurl, damn ya cute.\r\nI aint tryna come at you like a prostitute.\n\n[Hook]\n\n[Chorus x2]\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_19552705/su_0/rs_0/tr_3vUCANdLoXn2SRMujdlgvndSbUW5c0517FhwQoVQF1NzJk_c0zeA65Hydrzhxs0lhLUz7Ih0bU5iC5X5gJczHcH0ICZ-cf2s9-o3wBwl2ANpU5lOu8eC0Tc2kUWagsBmb_49AD8lCE6oonf0M9NDJrl6aO-sAX1ugqMUbPWalSGmqYtMVI-x-2xXCfCKhkZR5dCVocBbshM-eayqSWX9t-0NLt99Jjl_t3r_AwAzYMMAJ59UQhfjY0pCYDrV5bimsBINyOPqmF5p05fFX6muO3nkWUV4W7XqiUZWDXR2ILSQ-l-NCd0AUxvf5JtiwhFyBKu6-BTORIJdQ9nVqtWrX8tlmVQ3p5yLo-exmfzMJi8MHht5w7_bxViSqPZ3cVJT9KgAjXLZqScFai77GxC53QDPHodxBnGMkYxT2kNV29rRjXJwHBiYRt2xVS9U/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\nThanks to BRE22 for adding these lyrics.\nThanks to msbigbooty226, amandaagnew2002, tawandamcrae for correcting these lyrics.\n\n\n\n\n\nWriter(s): Chadron Moore, Radric Delantic Davis\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nalbum: \"Trap House\" (2005)\nIntro\nTrap House\nThat's All\nBooty Shorts\nIcy\nTwo Thangs\nMoney Don't Matter\nThat's My Hood\nLawnmower Man\nPyrex Pot\nIndependent Balling Like A Major #1\nBlack Tee\nCorner Cuttin\nIndependent Balling Like A Major #2\nHustle\nDamn Shawty\nGo Head\n\n\nalbum: \"Hard To Kill\" (2006)\nStreet Niggaz\nMy Chain\nHold Dat Thought\nFreaky Gurl\nPillz\nGo Head\nTrap Starz\nDrive Fast\nStick Em Up\nEverybody Know Me\nWe Live This\nTrap Gurl\nAlley Cat\nBlow Pop\nBig Cat (Laflare)\n\n\n\n\n\n\n Search", 
  "title": "Go Head Lyrics | AZLyrics.com", 
  "year": "2005"
}