{
  "album": "Trap House", 
  "lyrics": "\"Hustle\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Hustle\"\n\n\n\n[Chorus:]\nSince you can't get right Imma show you how to hustle, show you how to hustle show you how to hustle.\nMake a grind all night, Imma show you how to hustle, show you how to hustle, show you how to hustle..\nPut ya game down tight Imma show you how to hustle, show you how to husle, show you hwo to hustle.\nIt's an all night flight, Imma show you how to hustle, show you hustle, show you how to hustle (Yeahh)\n\n[Verse 1:]\n(ughh)\nI let my hater be my motivator, I got 20 pounds of purp in my frigerator. (ughh)\nSo damn an investergator, when I re-up they bring it in a tractor trailor. (ughh)\nI'm the king of Decatur man, got that fruity dro any kinda flavor man, (ughh)\nBubble cush or that purple thrax, white rhino you ain't never heard of dat. (ughh)\nI got them sevens fr the buck fifty, 125 if an nigga fuck wit me.\n(ughh) you doin bad buyin 50 slabs, I'm in Texico buyin out sandwich bags (ughh)\nNiggas churpin on my Nextel, Gucci what it look like nigga fish scales (ughh)\nI use to hold down the Hotel, now I'm a member of the Big Cat Cartel\n\n[Chorus]\n\n[Verse 2:]\n(ughh)\nI use to be the nigga wit the dimes, now I'm on the grind wit the 4's and the 9's. (ughh)\nThey say it's Gucci time to shine, a young black Enterprenuer in nhis prime (ughh)\nA nigga gota get the whole thang, 19-5 evrytime my phone rang (ughh)\nI got so much clientell, black tee, black Gat and a pocket scale (ughh)\nSo I can't go broke man, niggas know me as the Dope man's dope man (ughh)\nI made this one for my folks man, for the J's thatb be smokin outta coke cans (ughh)\nand they askin for a wake up, you wanna a brick I gotcha covered like make-up. (ughh)\nso wantcha holla atcha boy, you drop a couple dollars, I'll getcha coke, I'll getcha boi\n\n[Chorus]\n\nIma trappa not a rappa\nWhole thang gon' shake time to bust it out the rapper(ugh)\nSo I aint gotta go plaid\nima make half a mil when my pockets get back(ugh)\nGucci mane on the track im the next best thang since cooked up crack (ugh)\nI get my car washed free cause the fiends in the hood man they really love me (ugh)\nTrash bag fulla trees lil boys say dey wanna be just like me (ugh)\nI move so much purp make a nigga in the hood think his scale dont work (ugh)\nSince I linked up with Big Cat he told me I cant sell nothin less that a ten pack (ugh)\nMy whole advance check I spent that 100 bricks 50 bells and my ten strap(ugh)\n\n[Chorus]\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_2168596/su_0/rs_0/tr_3vUCAFtpREXtngWqPpWnUM9tOH4KwpUmICujdETA1sGgUIVoRgRWiKOYEGdNTONcEIBtF5HXPb5t-4xPdrrZ4giovso1cEB4x2d_YMahqapLP_OUEeE4R_7FdVvJs9-ABQs90dsqStoTu4UjiOYj-Xr7pdMZxgl59z_5rTAKfMC_StE2d3EkVJAaFk4BHdo6aHkitdiIPqmu4Gw02sb8qSr8TSiviQr54bCMnrNohmFfF4Q9ULK-yzxq2KWsW3xBHsX-OMgRsjrokanjyVZvmqJZZFgMWiVD6N_wLnzuTuRFAF2VZBMA4N8pCEwwbb7RXj27BnFHdmE52mxv5tiMgbM5hD8yGqbYCXDFjdW27HSWw62pRwnOfLub_l8YcOnxo6mqOHgweL2NmFBUBPv62Xn1UaSM5-tPxacxtR8KnAgvmKWuboP5a7DdDw/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\nThanks to Dylan for correcting these lyrics.\n\n\n\n\n\nWriter(s): Xavier Dotson, Radric Delantic Davis\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nalbum: \"Trap House\" (2005)\nIntro\nTrap House\nThat's All\nBooty Shorts\nIcy\nTwo Thangs\nMoney Don't Matter\nThat's My Hood\nLawnmower Man\nPyrex Pot\nIndependent Balling Like A Major #1\nBlack Tee\nCorner Cuttin\nIndependent Balling Like A Major #2\nHustle\nDamn Shawty\nGo Head\n\n\n\n\n\n\n Search", 
  "title": "Hustle Lyrics | AZLyrics.com", 
  "year": "2005"
}