{
  "album": "Hard To Kill", 
  "lyrics": "\"Big Cat (Laflare)\" lyrics\n\nGucci Mane Lyrics\n\n\n\n\n\"Big Cat (Laflare)\"\n\n\n\n[Verse 1]\r\nLaborginis Ferraris & Bentleys we boats and jetskis Cristal Don-P tha kush the P.T. two facts about me bitch ask about me big cats around me big stacks round big gats round me tha thrax round me purple packs around me no sacks round me I smoke like marley I niggaz ride harleys I hurt ya daughter feelings mrs.jackson I'm sorry I'm pimpin like goldie and ballin like koby these haters get found thrown in the oppanoke yo bich she choose me you mad she choose me I'm glad she choose me she gave me her room key the time on White St. the time in D.C gucci tha ol' G they put me on T.V. I'm gutta like B.G. I'm reppin the B.C. the jealous ones envy cuz it's somethin against me \n\n[Chorus x2]\n\r\nYou fuck with me you fuck with them you fuck with them you stuck with me big cat laflare we don't fight fair big cat laflare na we don't fight fiar\n\n[Verse 2]\r\nGot major flavor got major label got major niggaz cuz we got major paper ball hard like we major league baseball players who is Sherley Franklin cuz Gucci Mane the mayor I run the city I am the city Bad Boy but I never did sign with Diddy I bake the cake I make the cake 36 what I cop like jacob plat my team the champs yo team the chumps my squads the spurs hell yo suads the pumps unload the pump unload the pump explode the pump then reload the pump don't move the trunkl you fit in the trunk you set in tha trunk til ya body stank like a shunk the city of thieves drug dealers and G's my niggaz gamble all my niggaz smoke weed \n\n[Chorus x2]\n\n[Verse 3]\r\nMy money got a mouth so I let it talk for me half a mill worth of ice what it bought for me I'm on tha bubble kush man thats a rich high I order Cris by the case I'm a rich guy I'm 25 but I ride like I'm 67 cuz when I ride man I ride with the mac 11 a quater pound worth of purple thrax to smoke on so iced out I think I need my coat on the young nigga with the shades and the gold fronts why you stunt so hard you only live once I'm in the club real high and I'm real drunk I'm on my third bar and I'm on my eight blunt I'm leavin with your girl with the pump right in the front with them 28's call Roy Dunes I'm from East Atlanta boy this is how it's done we rock them old school verses with the Georgia sun\n\n[Chorus x2]\n\n\n\n\n\r\nif  ( /Android|webOS|iPhone|iPod|iPad|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) \r\n  {\r\n     document.getElementById('azmxmbanner').style.display='block';\r\n     document.write('<div style=\"margin-left: auto; margin-right: auto;\">'+\r\n  '<iframe scrolling=\"no\" style=\"border: 0px none; overflow:hidden;\" src=\"//adv.mxmcdn.net/br/t1.0/m_js/e_0/sn_0/l_19560821/su_0/rs_0/tr_3vUCADTd1PwpTBTzZ2K6RsyD0aST5gkZIWfUpe_C0cQi4LCeEas9HCr1fLddsDZwwSGGVL_XeECPbObfj_4dxwD54EmE_yNLsRd__lvQz669_nkn_313A1rOF5f-qknzWr0agPx_AHBUvlCkLgkEO5jTV1n5yHhe0J9Kza9hO7YecseMzr_l_wgu_B8GEtm5UPHGC684IeaxjrZetXlPaAePyPz3i3dQsvardwb65oN2f7G3oWQ6eCtSQw-rnPoAavTimxof7ikr8xGLGWRr6OFsafQpELGIbqH1_68ok3v9Euorgsw9orgOrnsMwHOm_AIkw1VW01dw1ifcGHnDpj5Jq3bPUI8HZzGSktAU9M1YOp_510ohWboU6LWCJNi73dIV0mKOdLXM1wsD75eCJSx1YHDDYa2LF2jQGxI3Spx_tzQC-8719aVahP2b0NRrAO2CXs8J/\" width=\"290px\" height=\"50px\"></iframe>'+\r\n  '</div>');\r\n   }\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n Submit Corrections\n\n\n\n\n\n\nWriter(s): Xavier Dotson, Radric Delantic Davis\n\n\n\n\n\nAZLyrics\nG\nGucci Mane Lyrics\n\n\n\nalbum: \"Hard To Kill\" (2006)\nStreet Niggaz\nMy Chain\nHold Dat Thought\nFreaky Gurl\nPillz\nGo Head\nTrap Starz\nDrive Fast\nStick Em Up\nEverybody Know Me\nWe Live This\nTrap Gurl\nAlley Cat\nBlow Pop\nBig Cat (Laflare)\n\n\n\n\n\n\n Search", 
  "title": "Big Cat (Laflare) Lyrics | AZLyrics.com", 
  "year": "2006"
}